INSERT INTO Users (AbsClientId) VALUES
('12dsaf1'),
('Asdf1234'),
('125efd1'),
('6456fcds'),
('sdf123fsd');
GO

INSERT INTO Branches (City, Address) VALUES
('лНЯЙБЮ', 'аНКЭЬЮЪ оЕПЕЪЯКЮБЯЙЮЪ 50Я1'),
('лНЯЙБЮ', 'оПНЯОЕЙР лХПЮ 39'),
('хФЕБЯЙ', 'сКХЖЮ ЩЯЙЭЧЩЕКЕБЮ 21');
GO

INSERT INTO CashOrders (UserId, BranchId, CreatedAt, Amount, Fee, Currency, PickupFrom, PickupTo, PickupAt, Status, AbsOperationId, ErrorMessage) VALUES
(1, 1, '20250110', 50000, 500, 'RUB', '20250111', '20250111 18:00', '20250111 13:00', 'гюбепьемн', 'ABS123', NULL),
(2, 1,'20250212',700,7, 'EUR', '20250213', '20250213 18:00', NULL,'днярюбйю ондрбепфдемю', 'ABS1412354', NULL),
(3, 1, '20250305', 30000, 300, 'RUB', '20250306', '20250306 18:00', NULL,'япедярбю гюакнйхпнбюмш', 'ABS141235432f4', NULL),
(4, 1, '20250415', 900, 9, 'USD', '20250416', '20250416 18:00', '20250416 14:00', 'гюбепьемн', 'ABS234df653qs46', NULL),
(5, 1, '20250520', 40000, 400, 'RUB', '20250521', '20250521 18:00', NULL,'нрлемемн', NULL, 'Not enough money'),
(1, 1, '20250602', 60000, 600, 'RUB', '20250603', '20250603 18:00', NULL,'янгдюмн', NULL, NULL),
(1, 2, '20250108', 50000, 500, 'RUB', '20250109', '20250109 18:00', '20250109 13:00', 'гюбепьемн', 'ABS144563456', NULL),
(2, 2,'20250218',  700, 7, 'EUR', '20250219', '20250219 18:01',NULL,'днярюбйю ондрбепфдемю', 'ABS12414', NULL),
(3, 2,'20250322', 300, 3, 'USD', '20250323', '20250323 18:00',NULL,'япедярбю гюакнйхпнбюмш', 'ABS-OP-3', NULL),
(4, 2, '20250411', 90000, 900, 'RUB', '20250412', '20250412 18:00','20250412 14:00', 'гюбепьемн', 'ABS435653', NULL),
(3, 3, '20250114',  400, 4, 'USD', '20250115', '20250115 18:00',NULL,'япедярбю гюакнйхпнбюмш', 'ABS43665', NULL),
(4, 3,'20250310', 55000, 550, 'RUB', '20250311', '20250311 18:00', '20250311 13:30', 'гюбепьемн', 'ABS234236', NULL),
(5, 3, '20250518',750, 7, 'EUR', '20250519', '20250519 18:00', NULL,'днярюбйю ондрбепфдемю', 'ABS1234', NULL),
(2, 3, '20250607',900,9, 'USD', '20250608', '20250608 18:12', NULL,'янгдюмн', NULL, NULL);
GO

INSERT INTO LogisticsRequests (CashOrderId, CreatedAt, PlannedDeliveryAt, Status, ErrorMessage) VALUES
(1, '20250110', '20250110', 'днярюбкемн', NULL),
(2, '20250212', '20250212', 'опхмърн', NULL),
(4, '20250415', '20250415', 'днярюбкемн', NULL),
(7, '20250108','20250108', 'днярюбкемн', NULL),
(8, '20250218', '20250218', 'опхмърн', NULL),
(12,'20250114', '20250114', 'опхмърн', NULL);
GO